#include "rgb.h"


/************************************************************
*函数原型：void rgb_gpio_init(void)
*函数功能： 初始化rgb的GPIO口
*函数参数：无
*函数返回值：无
*函数备注：PB5---P1.2
           PB4---P1.1
           PA1---P1.0
           高电平点亮
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_gpio_init(void)
{
  GPIO_Init(GPIOA, GPIO_PIN_1, GPIO_MODE_OUT_PP_LOW_SLOW);
  GPIO_Init(GPIOB, GPIO_PIN_4, GPIO_MODE_OUT_PP_LOW_SLOW);
  GPIO_Init(GPIOB, GPIO_PIN_5, GPIO_MODE_OUT_PP_LOW_SLOW);
}

/************************************************************
*函数原型：void rgb_gree_on(void)
*函数功能： 打开rgb的绿色
*函数参数：无
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_gree_on(void)
{
  GPIO_WriteHigh(GPIOA, GPIO_PIN_1);
}



/************************************************************
*函数原型：void rgb_red_on(void)
*函数功能： 打开rgb的红色
*函数参数：无
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_red_on(void)
{
  GPIO_WriteHigh(GPIOB, GPIO_PIN_4);
}


/************************************************************
*函数原型：void rgb_blue_on(void)
*函数功能： 打开rgb的蓝色
*函数参数：无
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_blue_on(void)
{
  GPIO_WriteHigh(GPIOB, GPIO_PIN_5);
}


/************************************************************
*函数原型：void rgb_gree_off(void)
*函数功能： 关闭rgb的绿色
*函数参数：无
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_gree_off(void)
{
  GPIO_WriteLow(GPIOA, GPIO_PIN_1);
}


/************************************************************
*函数原型：void rgb_red_off(void)
*函数功能： 关闭rgb的红色
*函数参数：无
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_red_off(void)
{
  GPIO_WriteLow(GPIOB, GPIO_PIN_4);
}


/************************************************************
*函数原型：void rgb_blue_off(void)
*函数功能： 关闭rgb的蓝色
*函数参数：无
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_blue_off(void)
{
  GPIO_WriteLow(GPIOB, GPIO_PIN_5);
}


/************************************************************
*函数原型：void unknown_color(u32 time1,u32 time2,u32 time3)
*函数功能： 使rgb彩灯随便产生一种颜色
*函数参数：三个随机的时间
*函数返回值：无
*函数备注：无
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void unknown_color(u32 time1,u32 time2,u32 time3)
{
  GPIO_WriteHigh(GPIOA, GPIO_PIN_1);
  rgb_delay(time1);
  GPIO_WriteHigh(GPIOB, GPIO_PIN_4);
  rgb_delay(time2);
  GPIO_WriteHigh(GPIOB, GPIO_PIN_5);
  rgb_delay(time3);
}


/************************************************************
*函数原型：static rgb_delay(u32 time)
*函数功能： RGB内部使用延时函数
*函数参数：无
*函数返回值：无
*函数备注：P2.0  ----   PD2
*函数作者：LiGuang
*函数时间：2019-11-22
*函数修改时间：无
*************************************************************/
void rgb_delay(u32 time)
{
  u32 i=0;
  for(i=0;i<16000*time;i++)
  {
    ;
  }
}